package jan13;

public class TestMain {
/*
 * 서버 - 소프트웨어, 하드웨어 어디나
 *       기능 : 서비스를 제공하면 서버다
 * 클라이언트 - 소프트웨어,하드웨어가 될 수 도
 *       기능 : 서비스를 제공받는 쪽은 클라이언트다
 * 
 * 웹서버
 *   (클라이언트의 요청에 의해 html,css,image등의
 * 파일을 서버에서 찾아서 클라이언트에게 전송하는 일을
 * 하는 프로그램)
 * 
 * 웹클라이언트
 *   서버에 원하는 문서를 요청하여 그 결과를 받아서 화면에
 * 뿌려준다(브라우져)
 * 
 * 아이피가 도메인url - 80포트
 * 아이피 - 웹서버 프로그램이 있는 컴퓨터 위치값
 * 포트번호는 - 그 컴퓨터 내에서 웹서버프로그램 식별값
 * 
 * 웹서버 - 아파치
 * WAS(WebApplicationServer) - 와스(웹 응용프로그램 서버)
 * -html 문서내의 java소스를 번역해서 html 문서를
 * 만들어내는 일을 한다. 웹서버도 겸용
 * 톰캣(공짜),레진(가격대비 성능이 좋음),제우스(우리나라 관공서),웹로직(전세계 대부분의 기업들,가장 인기가 많음)...
 * 
 * WAS(톰캣)
 *   웹사이트(컨텍스트)
 *   
 * 1.프로젝트 만들기
 *   프로젝트
 *    ㄴWEB-INF
 *       ㄴclasses
 *       ㄴlib
 *    ㄴweb.xml
 *    
 * 2.톰캣에게 프로젝트가 어딨는지를 알려줘야한다
 *   그래야 콤탯이 이 프로젝트를 읽어서 서비스를 진행한다
 *   (1)conf폴더 아래에 server.xml 파일에 기술하는 방법
 *      -톰캣 1.5 이하버전에서 사용하던 방법
 *   (2)conf폴더/Catalina/localhost 아래에
 *      별도의 콘텍스트 파일 만들기
 *      xml 이고 utf-8 형식으로 저장해야 한다
 *      -톰캣 1.6 부터
 *      
 *      
 */
}
